package Book;

public class Titlle {
    public String Titllestr;
    public void show(){
        System.out.println("Заглавие книги - " + Titllestr);
    }



}
//Используя IDEA, создайте проект c пакетом. Требуется: Создать класс Book(Main). Создать классы Title,
// Author и Content, каждый из которых должен содержать одно строковое поле и метод void show ().
// Реализуйте возможность добавления в книгу названия книги, имени автора и содержания.
// Выведите на экран при помощи метода show() название книги, имя автора и Содержание.